{
    "newsItems": [
      {
        "id": 1,
        "title": "UoN to host Kenya’s Health Benefits & Tariffs Panel",
        "excerpt": "University of Nairobi has been appointed to host the Health Benefits Package and Tariffs Advisory Panel, a significant step toward advancing evidence-based healthcare decision-making in Kenya.",
        "content": "<p> University of Nairobi is hosting the Health Benefits Package and Tariffs Advisory Panel following its appointment by Kenya’s Cabinet Secretary for Health in February. The panel is tasked with reviewing the health benefits package, advising on fair pricing and tariffs for healthcare services, and monitoring the impact of the Social Health Authority (SHA) program to ensure continuous improvement.</p><br/><p> This initiative will promote a transparent, evidence-informed approach to the operationalization of the newly launched SHA program while facilitating the institutionalization of health technology assessment in the country.  </p><br/><p> <p>By hosting the panel, CEMA will serve as a joint secretariat with the Ministry of Health and leverage its expertise in health economics, epidemiology, actuarial science, and health sciences to support decision-making and policy development in Kenya.</p><br/> <br/>",
        "author": "Admin",
        "authorRole": "Health admin",
        "featured": true,
        "date": "2025-31-02",
        "category": "Announcements",
        "image": "/assets/uon.jpg",
        "tags": ["health policy", "HTA", "benefits package", "tariffs", "CEMA", "Kenya healthcare"]
      },


            {
        "id": 2,
        "title": " Health Benefits & Tariffs Advisory Panel Gazetted",
        "excerpt": " Health Benefits & Tariffs Advisory Panel Secretariat Gazettement",
        "content": "<p> The Health Benefits and Tariffs Advisory Panel secretariat has been gazetted following its appointment by the Ministry of Health, in February.  </p><br/><p> <p>The panel is tasked with reviewing the health benefits package, advising on fair pricing and tariffs for healthcare services, and monitoring the impact of the Social Health Authority (SHA) program to ensure continuous improvement.</p><br/> <br/>",
        "author": "Admin",
        "authorRole": "Health admin",
        "featured": true,
        "date": "2025-20-04",
        "category": "Health",
        "image": "/assets/test-image.jpg",
        "tags": ["health policy", "HTA",  "UoN", "Kenya healthcare"]
      }

    ]
  }



