{
    "newsItems": [
   {
        "id": 1,
        "title": "HBTAP members undergo intensive Health Technology Assessment training",
        "excerpt": "HBTAP members undergo intensive Health Technology Assessment training",
        "content": "<p>The Health Benefits and Tariffs Advisory Panel (HBTAP) members, along with a section of stakeholders, underwent training last week in Naivasha designed with the overall goal of equipping participants with the knowledge and skills necessary for applying Health Technology Assessment (HTA) methodologies in appraising scientific evidence to inform benefits and tariffs reimbursable under Kenya’s Social Health Insurance.</p></br> <p>Some of the areas covered during the training included the fundamentals of HTA, where members were taken through sessions to help them understand the epidemiological, economic, and social methodologies and processes used in healthcare decision-making. </p> </br> <p>Participants also learnt how to generate and appraise epidemiological and economic evidence to support HTA decisions. Additional topics included ethical and social considerations, decision-making frameworks, identifying implementation challenges, and developing strategies for sustainability and long-term success. The training also featured practical sessions to reinforce learning. </p> </br> <p>The training aimed to equip panel members with essential knowledge in preparation for the intensified phase of their work. </p> </br> <p> Gazetted in April, the panel is mandated to review and appraise HTA reports, economic evaluations, and other relevant evidence. They are responsible for conducting deliberations based on explicit appraisal criteria such as clinical effectiveness, cost-effectiveness, equity, and ethical considerations.</p> </br> <p>The panel is also tasked with prioritizing technologies and services for assessment when needed; recommending the inclusion or exclusion of technologies in benefits packages; and advising on tariff prices based on cost analyses and prevailing market rates. </p> </br> <p> Also, the panel is mandated to advise on methods and processes for health benefits and tariff decision-making. They are also expected to engage stakeholders when necessary, including through public consultations, and to document and disseminate decisions and rationales to promote transparency</p> </br> <p> The panel submits its recommendations to the Cabinet Secretary for Health. </p>",
         "author": "Admin",
        "authorRole": "Health admin",
        "featured": true,
        "date": "2025-18-06",
        "category": "Health",
        "image": "/assets/hbtap meeting.jpeg",
        "tags": ["HBTAP Training"]

   },
      {
        "id": 2,
        "title": "Health CS Duale inaugurates HBTAP",
        "excerpt": "Health Benefits & Tariffs Advisory Panel Gazettement",
        "content": "<p> Kenya’s Health Cabinet Secretary, Aden Duale, inaugurated the Health Benefits and Tariffs Advisory Panel (HBTAP) in May, kick-starting the group’s efforts towards ensuring access to quality healthcare in the country. </p></br> <p>The HBTAP, according to Duale, will provide expert advice on the design and review of benefit packages and tariffs under the Social Health Insurance framework. The panel will deliver on its mandate through a process that is evidence-based, equitable, financially-sustainable, and aligned with national health priorities. </p><br/> <p>“This initiative marks a significant step in strengthening partnerships across government, academia, the private sector, and civil society. Such collaboration will ensure transparency, accountability, and broad stakeholder input—crucial ingredients for achieving affordable, high-quality healthcare for all Kenyans under the principle of “Leaving No One Behind,” said Duale.   </p><br/> <p>The Panel, hosted at the University of Nairobi (UoN), College of Health Sciences, will be augmented by a secretariat comprising Health Technology specialists based at Center for Epidemiological and Modelling Analysis (CEMA). </p> <br/> <p>Hosting the Panel at the UoN is part of the government’s plan to Institutionalize the Health Technology Assessment (HTA) process in Kenya and to ensure the institution’s contribution to academic and technical expertise that underpins high-quality, evidence-informed decision making. </p><br/>   <p>“To enhance the effectiveness of our Social Health Insurance system, we must adopt data-driven decision-making, prioritize cost-effective interventions, strengthen public-private partnerships, and leverage digital solutions to improve service delivery and policy evaluation,” Duale said. </p><br/>",
        "author": "Admin",
        "authorRole": "Health admin",
        "featured": false,
        "date": "2025-20-04",
        "category": "Health",
        "image": "/assets/unnamed.jpg",
        "tags": ["HBTAP launch"]
      },
     
            {
        "id": 3,
        "title": " Health Benefits & Tariffs Advisory Panel Gazetted",
        "excerpt": " Health Benefits & Tariffs Advisory Panel Gazettement",
        "content": "<p> The Health Benefits and Tariffs Advisory Panel has been gazetted following its appointment by the Ministry of Health, in February, to guide the Social Health Authority (SHA) on tarrifs and benefits.  </p><br/><p> <p>The panel is tasked with reviewing the health benefits package, advising on fair pricing and tariffs for healthcare services, and monitoring the impact of the Social Health Authority (SHA) program to ensure continuous improvement.</p><br/> <br/>",
        "author": "Admin",
        "authorRole": "Health admin",
        "featured": true,
        "date": "2025-20-04",
        "category": "Health",
        "image": "/assets/test-image.jpg",
        "tags": ["health policy", "HTA",  "UoN", "Kenya healthcare"]
      },
 {
        "id": 4,
        "title": "UoN to host Kenya’s Health Benefits & Tariffs Panel",
        "excerpt": "University of Nairobi has been appointed to host the Health Benefits Package and Tariffs Advisory Panel, a significant step toward advancing evidence-based healthcare decision-making in Kenya.",
        "content": "<p> University of Nairobi is hosting the Health Benefits Package and Tariffs Advisory Panel following its appointment by Kenya’s Cabinet Secretary for Health in February. The panel is tasked with reviewing the health benefits package, advising on fair pricing and tariffs for healthcare services, and monitoring the impact of the Social Health Authority (SHA) program to ensure continuous improvement.</p><br/><p> This initiative will promote a transparent, evidence-informed approach to the operationalization of the newly launched SHA program while facilitating the institutionalization of health technology assessment in the country.  </p><br/><p> <p>By hosting the panel, CEMA will serve as a joint secretariat with the Ministry of Health and leverage its expertise in health economics, epidemiology, actuarial science, and health sciences to support decision-making and policy development in Kenya.</p><br/> <br/>",
        "author": "Admin",
        "authorRole": "Health admin",
        "featured": false,
        "date": "2025-31-02",
        "category": "Announcements",
        "image": "/assets/uon.jpg",
        "tags": ["health policy", "HTA", "benefits package", "tariffs", "CEMA", "Kenya healthcare"]
      }


    ]
  }



